app/views/songs/index.html.erb

SELECT "songs".* FROM "songs"
---
<ul>
<% Song.all.each do |song| %>