app/controllers/artists_controller.rb

  def index
    if params[:song_id]
      @song = Song.find_by_id(params[:song_id])
      if @song
       @artists = @song.artists
      else
        redirect_to artists_path
      end
    else
      @artists = Artist.all
---
SELECT "songs".* FROM "songs" WHERE "songs"."artist_id" = ?  [["artist_id", 1]]
SELECT "artists".* FROM "artists"